# Pandas

* Pandas is an open source data analysis library written in python.
* It leverages the power and speed of numpy to make data analysis and preprocessing easy for data scientists
* It provides rich and highly robust data operations

## Pandas has two types of data structures:

     a) SERIES - It's a diamensional array with indexes, it stores a single column or row in Dataframe.
     b) DATAFRAME - It's a tabular spreadsheet like structure representing rows each of which contains one or multiple
     columns
     
     
* A one-diamensional array(labeled) capable of holding any type of data- series
* A two-diamensional data(labeled) structure with columns of potentially different types of data - DataFrame

## Data Frame

In [1]:
import numpy as np
import pandas as pd

In [2]:
dicti = {'name':['shruti','shubh','soumya','sourabh'],
         'marks':[92,81,97,85],
         'city':['Auriya','kolkata','itarsi','indore']}

In [3]:
df = pd.DataFrame(dicti)

In [4]:
print(df)

      name  marks     city
0   shruti     92   Auriya
1    shubh     81  kolkata
2   soumya     97   itarsi
3  sourabh     85   indore

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_indexFalse.csv',index=False)

In [7]:
df.head(2)

     name  marks     city
0  shruti     92   Auriya
1   shubh     81  kolkata

In [8]:
df.tail(3)

      name  marks     city
1    shubh     81  kolkata
2   soumya     97   itarsi
3  sourabh     85   indore

In [9]:
df.describe()

           marks
count   4.000000
mean   88.750000
std     7.135592
min    81.000000
25%    84.000000
50%    88.500000
75%    93.250000
max    97.000000

In [10]:
df

      name  marks     city
0   shruti     92   Auriya
1    shubh     81  kolkata
2   soumya     97   itarsi
3  sourabh     85   indore

In [12]:
shruti = pd.read_csv('shruti.csv')

In [13]:
shruti

   train no.  Speed     city
0       2500     92   Auriya
1       2525     81  kolkata
2       9898     97   itarsi
3       2343     85   indore

In [16]:
shruti['Speed']

0    92
1    81
2    97
3    85
Name: Speed, dtype: int64

In [18]:
shruti['Speed'][0]

92

In [19]:
shruti['Speed'][0] = 182

C:\Users\sshou\AppData\Local\Temp/ipykernel_8528/819578657.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  shruti['Speed'][0] = 182

In [20]:
shruti

   train no.  Speed     city
0       2500    182   Auriya
1       2525     81  kolkata
2       9898     97   itarsi
3       2343     85   indore

In [21]:
shruti.to_csv('shruti.csv')

In [22]:
shruti.index = ['first','second','third','fourth']

In [23]:
shruti

        train no.  Speed     city
first        2500    182   Auriya
second       2525     81  kolkata
third        9898     97   itarsi
fourth       2343     85   indore